#+Title: Constructors, Destructors, Pointers and References
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2023-09-22
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:2
#+STARTUP: beamer

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH_msv

* Constructors in Java
- Constructors work similarly to C++

#+begin_src java :file Cat.java :imports java.util.ArrayList
  public class Cat {
    public String name;
    public ArrayList<String> colours;

    Cat() { // Default constructor
      colours = new ArrayList<>();
      colours.add("Brown");
      name = "youthere";
      System.out.println("Default Constructor " + name);
    }

    Cat(String theName, ArrayList<String> theColours) {
      name = theName;
      colours = theColours;
      System.out.println("Constructor " + name);
    }

    Cat(Cat original) { // Copy constructor
      name = original.name; // Strings are special, so this one behaves as expected
      colours = original.colours; // But be careful with other object references. See in the main function below...
      System.out.println("Copy Constructor " + name);
    }

    public String toString() {
      return "a cat with the name " + name + " and the colours " +colours.toString();
    }

    public static void doSomething(Cat theCat) {
      System.out.println("Doing something with " + theCat.toString());
    }

    public static void main(String [] args) {
      Cat stray = new Cat();
      System.out.println("Stray: " + stray.toString());

      //Cat mongrel = stray; // Create a new reference 'mongrel', and points it at the same object as 'stray'
      Cat mongrel = new Cat(stray); // Invoke the copy constructor

      mongrel.name="Manny";
      mongrel.colours.add("White"); // This is where the "Just copy the reference" will bite us!
      System.out.println("Mongrel: " + mongrel.toString());
      System.out.println("Stray, as it is now: " + stray.toString());

      doSomething(mongrel); // Will only pass the reference, less risk of accidentally copying the object
    }
  }
#+end_src

#+RESULTS:
: Default Constructor youthere
: Stray: a cat with the name youthere and the colours [Brown]
: Copy Constructor youthere
: Mongrel: a cat with the name Manny and the colours [Brown, White]
: Stray, as it is now: a cat with the name youthere and the colours [Brown, White]
: Doing something with a cat with the name Manny and the colours [Brown, White]

* Destructor in Java
- ~public void finalize() {}~
- ~finalize()~ is being removed from Java (/Deprecated/), avoid using it.
- Is run when the garbage collector decides to clean up the object
  - ... Which may be too late
- Can not rely on this ever being run. Or in any partcular order.
- Use to make sure that open files and ports are closed. Do not rely on this.
- Garbage Collector runs in its own thread.
- We can force the gc to run, but normally we do not need to.

#+begin_src java :file Dog.java
  public class Dog {
    public String name;

    public Dog() { this("Goodboy"); }
    public Dog(String theName) {
      name = theName;
      System.out.println("Create " + name);
    }

    public Dog(Dog original) { // Copy Constructor
      name = original.name;
      System.out.println("Copy " + name);
    }

    public void finalize() {
      System.out.println("Closing down and clenaing up " + name);
    }

    public static void main(String [] args) {
      Dog danny = new Dog();
      Dog clony = new Dog(danny); // This invokes the copy constructor
      clony.name = "ClonyBoy";
      System.out.println("Danny: " + danny.name +"\nClony: " + clony.name);

      Dog clonyclony = clony;

      danny = null; // No remaining references to danny, will be garbage collected
      clony = null; // ClonyBoy still has one reference.
      System.gc();
      System.out.println("Just ran the Garbage Collector");
    }
  }

#+end_src

#+RESULTS:
: Create Goodboy
: Copy Goodboy
: Danny: Goodboy
: Clony: ClonyBoy
: Just ran the Garbage Collector
: Closing down and clenaing up Goodboy

* Pointers and Java: Pass by Value
- Anything created by ~new~ is an object
- All objects are accessed by a /reference/
- References mostly work as c++ pointers

#+begin_src java
  Cat mierda = new Cat("Mierda");
  Cat caca;

  caca = mierda; // Copy the reference to the same object

  doSomething(mierda); // Pass along a reference to the same object  
#+end_src

- In method calls, Java /always use pass by value/
  - as expected with built-in data types
  - when the parameter is a reference to an object, the value passed is the /reference/, not the object.  
  - Pass by reference is not possible. Use return to return modified element instead.

#+begin_src java
  public static void doSomething(String someString) {
    someString = "not hello"; // Only changes the reference locally
  }

  public static String doChange(String someString) {
    return "modified " + someString;
  }

  public static void main(String [] args) {
    String s = "hello";
    doSomething(s);
    System.out.println(s);
    System.out.println(doChange(s));
  }

#+end_src

#+RESULTS:
: hello
: modifiedhello

